HCHCHC99/WS/T_v.4.36.15_20260428/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Adp/Motor_hall.c
#include "Motor_hall.h"
#include "timer6_timebase.h"
#include "TickTimer.h"
#include "hc32_ll_gpio.h"
#include "hc32_ll_interrupts.h"
#include <string.h>
#include <stdlib.h>
#include "rtt_log.h"

/* ========== ϵͳ��ȫ�ֱ��� ========== */
static uint8_t g_system_initialized = 0;
static uint8_t g_next_handle_id = 0;

/* ========== ������������ ========== */
#define MIN_PULSE_INTERVAL_US       (50u)
#define MAX_PULSE_INTERVAL_US       (200000u)
#define STALL_DETECTION_MS          (500u)
#define STOP_DETECTION_MS           (50u)
#define RPM_WINDOW_SIZE             (6)
#define DIRECTION_CONFIRM_COUNT     (3)
#define HALL_CHECK_INTERVAL_MS      (1000)
#define HALL_WARNING_THRESHOLD      (10)

/* ========== ���ʵ���ڲ����ݽṹ ========== */
typedef struct {
    uint8_t id;
    uint8_t valid;
    
    motor_hall_config_t config;
    
    struct {
        uint8_t hall_a_port;
        uint16_t hall_a_pin;
        uint8_t hall_b_port;
        uint16_t hall_b_pin;
        uint8_t irq_priority;
    } irq_config;
    
    volatile uint32_t last_pulse_interval;
    volatile uint64_t last_pulse_time_us;
    volatile uint32_t pulse_counter;
    volatile uint8_t  speed_data_ready;
    volatile float    current_rpm;
    volatile float    filtered_rpm;
    
    volatile uint32_t hall_pulse_counts[
#if MOTOR_HALL_TRIPLE_ENABLE
        3
#else
        2
#endif
    ];
    volatile uint8_t  active_hall_count;
    
    volatile motor_direction_t current_direction;
    volatile motor_direction_t last_valid_direction;
    volatile uint8_t  direction_confidence;
    volatile uint8_t  direction_confirm_count;
    volatile uint8_t  direction_data_ready;
    volatile uint8_t  direction_changed;
    
    volatile uint32_t hall_a_last_second_count;
    volatile uint32_t hall_b_last_second_count;
    volatile hall_working_status_t hall_status;
    
    volatile uint8_t  stalled;
    volatile uint8_t  measurement_valid;
    volatile uint32_t total_measurements;
    volatile uint32_t error_count;
    
    float rpm_window[RPM_WINDOW_SIZE];
    uint8_t write_index;
    uint8_t valid_count;
    
    uint32_t interval_history[6];
    uint8_t interval_idx;
    uint8_t interval_valid_count;
    
    NonBlockingDelay_t rpm_timer;
    NonBlockingDelay_t hall_check_timer;
    
    uint8_t is_running;
    uint8_t need_update;
    
} motor_hall_instance_t;

#define MAX_MOTOR_INSTANCES     (4)

static motor_hall_instance_t g_instances[MAX_MOTOR_INSTANCES] = {0};

static motor_hall_instance_t* g_hall_a_map[16] = {NULL};
static motor_hall_instance_t* g_hall_b_map[16] = {NULL};
#if MOTOR_HALL_TRIPLE_ENABLE
static motor_hall_instance_t* g_hall_c_map[16] = {NULL};
#endif

static motor_hall_instance_t* g_current_hall_a_instance = NULL;
static motor_hall_instance_t* g_current_hall_b_instance = NULL;
#if MOTOR_HALL_TRIPLE_ENABLE
static motor_hall_instance_t* g_current_hall_c_instance = NULL;
#endif

/* ========== �ڲ��������� ========== */
static void update_rpm_filter(motor_hall_instance_t* inst, float new_rpm);
static float calculate_average_interval(motor_hall_instance_t* inst);
static float interval_to_rpm(motor_hall_instance_t* inst, uint32_t interval_us);
static void perform_stall_detection(motor_hall_instance_t* inst);
static void check_hall_status(motor_hall_instance_t* inst);
static uint8_t calculate_active_hall_count(motor_hall_instance_t* inst);

/* ========== ϵͳ��ʼ�� ========== */
void motor_hall_system_init(void)
{
    if (g_system_initialized) return;
    
    Timer6_Timebase_Init();
    Timer6_Timebase_Start();
    
    memset(g_instances, 0, sizeof(g_instances));
    memset(g_hall_a_map, 0, sizeof(g_hall_a_map));
    memset(g_hall_b_map, 0, sizeof(g_hall_b_map));
    
    g_system_initialized = 1;
}

/* ========== �������� ========== */

static uint8_t calculate_active_hall_count(motor_hall_instance_t* inst)
{
    uint8_t count = 0;
    if (inst->config.eirq_ch_a != 0) count++;
    if (inst->config.eirq_ch_b != 0) count++;
#if MOTOR_HALL_TRIPLE_ENABLE
    if (inst->config.eirq_ch_c != 0) count++;
#endif
    return count;
}

/* ========== �жϻص�������ȫ�֣� ========== */

static void hall_a_irq_callback(void)
{
    motor_hall_instance_t* inst = g_current_hall_a_instance;
    if (!inst || !inst->valid) return;
    
    EXTINT_ClearExtIntStatus(inst->config.eirq_ch_a);
    
    inst->hall_pulse_counts[0]++;
    
    uint32_t interval_counter = Timer6_Timebase_GetDelta();
    uint32_t interval_us = Timer6_Timebase_DeltaToUs(interval_counter);
    
    if (interval_us >= MIN_PULSE_INTERVAL_US && interval_us <= MAX_PULSE_INTERVAL_US) 
    {
        inst->last_pulse_interval = interval_us;
        inst->last_pulse_time_us = Timer6_Timebase_GetTimestamp();
        inst->pulse_counter++;
        inst->stalled = 0;
        inst->speed_data_ready = 1;
    }
}

static void hall_b_irq_callback(void)
{
    motor_hall_instance_t* inst = g_current_hall_b_instance;
    if (!inst || !inst->valid) return;
    
    EXTINT_ClearExtIntStatus(inst->config.eirq_ch_b);
    
    inst->hall_pulse_counts[1]++;
    
    uint32_t interval_counter = Timer6_Timebase_GetDelta();
    uint32_t interval_us = Timer6_Timebase_DeltaToUs(interval_counter);
    
    if (interval_us >= MIN_PULSE_INTERVAL_US && interval_us <= MAX_PULSE_INTERVAL_US) 
    {
        inst->last_pulse_interval = interval_us;
        inst->last_pulse_time_us = Timer6_Timebase_GetTimestamp();
        inst->pulse_counter++;
        inst->stalled = 0;
        inst->speed_data_ready = 1;
    }
    
    static uint8_t hall_b_last[4] = {0xFF, 0xFF, 0xFF, 0xFF};
    uint8_t hall_b_current = (GPIO_ReadInputPins(inst->irq_config.hall_b_port, inst->irq_config.hall_b_pin) == PIN_SET);
    
    inst->direction_data_ready = 1;
    
    if (hall_b_last[inst->id] == 0xFF) {
        hall_b_last[inst->id] = hall_b_current;
        return;
    }
    
    if (hall_b_last[inst->id] == 1 && hall_b_current == 0) {
        if (inst->current_rpm == 0) {
            hall_b_last[inst->id] = hall_b_current;
            return;
        }
        
        uint8_t hall_a_state = (GPIO_ReadInputPins(inst->irq_config.hall_a_port, inst->irq_config.hall_a_pin) == PIN_SET);
        motor_direction_t detected_direction = hall_a_state ? MOTOR_DIRECTION_FORWARD : MOTOR_DIRECTION_REVERSE;
        
        if (inst->current_direction != detected_direction) {
            inst->direction_confirm_count++;
            
            if (inst->direction_confirm_count >= DIRECTION_CONFIRM_COUNT) {
                motor_direction_t old_direction = inst->current_direction;
                inst->current_direction = detected_direction;
                inst->direction_confidence = 100;
                inst->last_valid_direction = detected_direction;
                inst->direction_confirm_count = 0;
                
                if (old_direction != detected_direction) {
                    inst->direction_changed = 1;
                }
            }
        } else {
            inst->direction_confirm_count = 0;
        }
    }
    
    hall_b_last[inst->id] = hall_b_current;
}

#if MOTOR_HALL_TRIPLE_ENABLE
static void hall_c_irq_callback(void)
{
    motor_hall_instance_t* inst = g_current_hall_c_instance;
    if (!inst || !inst->valid) return;

