HCHCHC99/WS/T_v.4.36.15_20260428/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Adp/Motor_hall.c
    EXTINT_ClearExtIntStatus(inst->config.eirq_ch_c);

    inst->hall_pulse_counts[2]++;

    uint32_t interval_counter = Timer6_Timebase_GetDelta();
    uint32_t interval_us = Timer6_Timebase_DeltaToUs(interval_counter);

    if (interval_us >= MIN_PULSE_INTERVAL_US && interval_us <= MAX_PULSE_INTERVAL_US)
    {
        inst->last_pulse_interval = interval_us;
        inst->last_pulse_time_us = Timer6_Timebase_GetTimestamp();
        inst->pulse_counter++;
        inst->stalled = 0;
        inst->speed_data_ready = 1;
    }
}
#endif

static void register_hall_irq(motor_hall_instance_t* inst, uint8_t is_hall_a)
{
    stc_extint_init_t stcExtiConfig;
    stc_irq_signin_config_t stcIrqRegiConf;
    stc_gpio_init_t stcPortInit;
    
    uint32_t eirq_ch;
    IRQn_Type irqn;
    uint32_t irq_src;
    uint8_t port;
    uint16_t pin;
    
    if (is_hall_a) {
        eirq_ch = inst->config.eirq_ch_a;
        irqn = (IRQn_Type)inst->config.irqn_a;
        irq_src = inst->config.irq_src_a;
        port = inst->config.hall_a_port;
        pin = inst->config.hall_a_pin;
        g_current_hall_a_instance = inst;
    } else {
        eirq_ch = inst->config.eirq_ch_b;
        irqn = (IRQn_Type)inst->config.irqn_b;
        irq_src = inst->config.irq_src_b;
        port = inst->config.hall_b_port;
        pin = inst->config.hall_b_pin;
        g_current_hall_b_instance = inst;
    }
    
    memset(&stcExtiConfig, 0, sizeof(stcExtiConfig));
    memset(&stcIrqRegiConf, 0, sizeof(stcIrqRegiConf));
    memset(&stcPortInit, 0, sizeof(stcPortInit));
    
    stcExtiConfig.u32Filter = EXTINT_FILTER_OFF;
    stcExtiConfig.u32FilterClock = EXTINT_FCLK_DIV1;
    stcExtiConfig.u32Edge = EXTINT_TRIG_BOTH;
    EXTINT_Init(eirq_ch, &stcExtiConfig);
    
    GPIO_StructInit(&stcPortInit);
    stcPortInit.u16PinDir = PIN_DIR_IN;
    stcPortInit.u16PinAttr = PIN_ATTR_DIGITAL;
    stcPortInit.u16PullUp = PIN_PU_ON;
    LL_PERIPH_WE(LL_PERIPH_GPIO);
    GPIO_Init(port, pin, &stcPortInit);

    GPIO_ExtIntCmd(port, pin, ENABLE);

    LL_PERIPH_WP(LL_PERIPH_GPIO);
	
    stcIrqRegiConf.enIntSrc = (en_int_src_t)irq_src;
    stcIrqRegiConf.enIRQn = irqn;
    if (is_hall_a) {
        stcIrqRegiConf.pfnCallback = (func_ptr_t)hall_a_irq_callback;
    } else {
        stcIrqRegiConf.pfnCallback = (func_ptr_t)hall_b_irq_callback;
    }
    INTC_IrqSignIn(&stcIrqRegiConf);
    
    EXTINT_ClearExtIntStatus(eirq_ch);
    NVIC_ClearPendingIRQ(irqn);
    NVIC_SetPriority(irqn, inst->config.irq_priority);
    NVIC_EnableIRQ(irqn);
}

static void update_rpm_filter(motor_hall_instance_t* inst, float new_rpm)
{
    inst->rpm_window[inst->write_index] = new_rpm;
    inst->write_index = (inst->write_index + 1) % RPM_WINDOW_SIZE;
    
    if (inst->valid_count < RPM_WINDOW_SIZE) {
        inst->valid_count++;
    }
    
    float sum = 0;
    uint8_t i;
    for (i = 0; i < inst->valid_count; i++) {
        sum += inst->rpm_window[i];
    }
    inst->filtered_rpm = sum / inst->valid_count;
}

static float calculate_average_interval(motor_hall_instance_t* inst)
{
    if (inst->last_pulse_interval >= MIN_PULSE_INTERVAL_US && 
        inst->last_pulse_interval <= MAX_PULSE_INTERVAL_US) {
        
        inst->interval_history[inst->interval_idx] = inst->last_pulse_interval;
        inst->interval_idx = (inst->interval_idx + 1) % 6;
        
        if (inst->interval_valid_count < 6) {
            inst->interval_valid_count++;
        }
        
        inst->measurement_valid = 1;
    }
    
    if (inst->interval_valid_count < 2) {
        return 0;
    }
    
    uint32_t sum = 0;
    uint8_t i;
    for (i = 0; i < inst->interval_valid_count; i++) {
        sum += inst->interval_history[i];
    }
    
    return (float)sum / inst->interval_valid_count;
}

static float interval_to_rpm(motor_hall_instance_t* inst, uint32_t interval_us)
{
    if (interval_us == 0 || interval_us > MAX_PULSE_INTERVAL_US) {
        return 0;
    }
    
    uint16_t pulses_per_rev;
    
    if (inst->config.custom_pulses_per_rev > 0) {
        pulses_per_rev = inst->config.custom_pulses_per_rev;
    } else {
        uint8_t active_halls = calculate_active_hall_count(inst);
        if (active_halls == 0) return 0;
        pulses_per_rev = inst->config.pole_pairs * 2 * active_halls;
    }
    
    float rpm = 60000000.0f / ((float)interval_us * pulses_per_rev);
    
    if (rpm > 100000.0f) rpm = 100000.0f;
    
    return rpm;
}

static void perform_stall_detection(motor_hall_instance_t* inst)
{
    uint64_t current_time_us = Timer6_Timebase_GetTimestamp();
    uint64_t time_since_last_pulse = current_time_us - inst->last_pulse_time_us;
    
    if (inst->current_rpm > 0 && time_since_last_pulse > (STOP_DETECTION_MS * 1000ul)) {
        if (inst->current_direction != MOTOR_DIRECTION_STOP) {
            inst->current_direction = MOTOR_DIRECTION_STOP;
            inst->direction_confidence = 0;
            inst->direction_confirm_count = 0;
            inst->direction_changed = 1;
        }
        inst->is_running = 0;
    } else if (inst->current_rpm > 0) {
        inst->is_running = 1;
    }
    
    if (time_since_last_pulse > (STALL_DETECTION_MS * 1000ul)) {
        inst->stalled = 1;
        inst->current_rpm = 0;
        inst->filtered_rpm = 0;
        inst->is_running = 0;
    }
}

static void check_hall_status(motor_hall_instance_t* inst)
{
    static uint32_t last_check_time[4] = {0};
    uint32_t current_time = tickTimer_GetCount();
    
    if (current_time - last_check_time[inst->id] >= HALL_CHECK_INTERVAL_MS) {
        last_check_time[inst->id] = current_time;
        
        inst->hall_a_last_second_count = inst->hall_pulse_counts[0];
        inst->hall_b_last_second_count = inst->hall_pulse_counts[1];

        /* determine active hall count from config */
        uint8_t cfg_hall_count = calculate_active_hall_count(inst);

#if MOTOR_HALL_TRIPLE_ENABLE
        /* count active halls by pulse activity */
        uint8_t active_by_pulse = 0;
        uint32_t counts[3];
        counts[0] = inst->hall_pulse_counts[0];
        counts[1] = inst->hall_pulse_counts[1];
        counts[2] = inst->hall_pulse_counts[2];

        uint8_t pulse_active[3] = {0};
        for (int h = 0; h < 3; h++) {
            if (cfg_hall_count > (uint8_t)h && counts[h] > 0) {
                pulse_active[h] = 1;
                active_by_pulse++;
            }
        }

        if (active_by_pulse == 0) {
            inst->hall_status = HALL_STATUS_NONE;
            inst->active_hall_count = 0;
        } else if (active_by_pulse == 1) {
            if (pulse_active[0])      { inst->hall_status = HALL_STATUS_A_ONLY; }
            else if (pulse_active[1]) { inst->hall_status = HALL_STATUS_B_ONLY; }
            else                      { inst->hall_status = HALL_STATUS_ERROR; }
            inst->active_hall_count = 1;
        } else {
            /* check balance across all active halls */
            uint8_t max_ok = 0;
            uint8_t failed = 0;
            for (int h = 0; h < 3; h++) {
                if (!pulse_active[h]) continue;
                uint32_t total = 0;
                for (int k = 0; k < 3; k++) {
                    if (pulse_active[k]) total += counts[k];
                }
                if (total == 0) break;
                /* compare this hall's count to the average of others */
                uint32_t avg_others = (total - counts[h]) / (active_by_pulse - 1);
                uint32_t diff = (counts[h] > avg_others) ? (counts[h] - avg_others) : (avg_others - counts[h]);
                if (avg_others > 0 && (diff * 100 / avg_others) <= HALL_WARNING_THRESHOLD) {
                    max_ok++;
                } else if (avg_others == 0) {
                    max_ok++;
                } else {
                    failed++;
                }
            }
            if (failed > 0) {
                inst->hall_status = HALL_STATUS_ERROR;
            } else {
                inst->hall_status = HALL_STATUS_BOTH;
            }
            inst->active_hall_count = active_by_pulse;
        }
#else
        if (inst->hall_pulse_counts[0] == 0 && inst->hall_pulse_counts[1] == 0) {
            inst->hall_status = HALL_STATUS_NONE;
        }
        else if (inst->hall_pulse_counts[0] > 0 && inst->hall_pulse_counts[1] == 0) {
            inst->hall_status = HALL_STATUS_A_ONLY;
            inst->active_hall_count = 1;
        }
        else if (inst->hall_pulse_counts[0] == 0 && inst->hall_pulse_counts[1] > 0) {
            inst->hall_status = HALL_STATUS_B_ONLY;
            inst->active_hall_count = 1;
        }
        else {
            uint32_t diff;
            uint32_t total = inst->hall_pulse_counts[0] + inst->hall_pulse_counts[1];

            if (inst->hall_pulse_counts[0] > inst->hall_pulse_counts[1]) {
                diff = inst->hall_pulse_counts[0] - inst->hall_pulse_counts[1];
            } else {
                diff = inst->hall_pulse_counts[1] - inst->hall_pulse_counts[0];
            }

