HCHCHC99/WS/T_v.4.36.15_20260428/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Adp/Motor_hall.c
            if (total > 0 && (diff * 100 / total) > HALL_WARNING_THRESHOLD) {
                inst->hall_status = HALL_STATUS_ERROR;
            } else {
                inst->hall_status = HALL_STATUS_BOTH;
                inst->active_hall_count = 2;
            }
        }
#endif
    }
}

static void calculate_rpm(motor_hall_instance_t* inst)
{
    float avg_interval = calculate_average_interval(inst);
    
    if (avg_interval == 0) {
        inst->current_rpm = 0;
        inst->filtered_rpm = 0;
        return;
    }
    
    float raw_rpm = interval_to_rpm(inst, (uint32_t)avg_interval);
    
    if (raw_rpm > 0) {
        inst->current_rpm = raw_rpm;
        update_rpm_filter(inst, raw_rpm);
        inst->total_measurements++;
    } else {
        inst->current_rpm = 0;
        inst->filtered_rpm = 0;
    }
}

/* ========== �����ӿ�ʵ�� ========== */

motor_hall_handle_t motor_hall_create(const motor_hall_config_t* config)
{
    if (!g_system_initialized) {
        motor_hall_system_init();
    }
    
    uint8_t i;
    for (i = 0; i < MAX_MOTOR_INSTANCES; i++) {
        if (!g_instances[i].valid) {
            break;
        }
    }
    
    if (i >= MAX_MOTOR_INSTANCES) {
        MAIN_D("motor_hall_create: No available instance!\r\n");
        return NULL;
    }
    
    motor_hall_instance_t* inst = &g_instances[i];
    memset(inst, 0, sizeof(motor_hall_instance_t));
    
    // ========== �����Ա��ֵ����ʹ�� memcpy ==========
    // GPIO����
    inst->config.hall_a_port = config->hall_a_port;
    inst->config.hall_a_pin = config->hall_a_pin;
    inst->config.hall_b_port = config->hall_b_port;
    inst->config.hall_b_pin = config->hall_b_pin;
    
    // �ж�����
    inst->config.eirq_ch_a = config->eirq_ch_a;
    inst->config.eirq_ch_b = config->eirq_ch_b;
    inst->config.irqn_a = config->irqn_a;
    inst->config.irqn_b = config->irqn_b;
    inst->config.irq_src_a = config->irq_src_a;
    inst->config.irq_src_b = config->irq_src_b;
    inst->config.irq_priority = config->irq_priority;
    
    // �������
    inst->config.pole_pairs = config->pole_pairs;
    inst->config.hall_count = config->hall_count;
    inst->config.custom_pulses_per_rev = config->custom_pulses_per_rev;

#if MOTOR_HALL_TRIPLE_ENABLE
    inst->config.hall_c_port = config->hall_c_port;
    inst->config.hall_c_pin = config->hall_c_pin;
    inst->config.eirq_ch_c = config->eirq_ch_c;
    inst->config.irqn_c = config->irqn_c;
    inst->config.irq_src_c = config->irq_src_c;
#endif

    // ���Դ�ӡ��ȷ�ϸ�ֵ��ȷ
    MAIN_D("motor_hall_create: instance %d\r\n", i);
    MAIN_D("  hall_a_port=%d, hall_a_pin=0x%04X\r\n", 
           inst->config.hall_a_port, inst->config.hall_a_pin);
    MAIN_D("  hall_b_port=%d, hall_b_pin=0x%04X\r\n", 
           inst->config.hall_b_port, inst->config.hall_b_pin);
    MAIN_D("  eirq_ch_a=%lu, eirq_ch_b=%lu\r\n", 
           inst->config.eirq_ch_a, inst->config.eirq_ch_b);
    MAIN_D("  irqn_a=%d, irqn_b=%d\r\n", 
           inst->config.irqn_a, inst->config.irqn_b);
    MAIN_D("  irq_src_a=%lu, irq_src_b=%lu\r\n", 
           inst->config.irq_src_a, inst->config.irq_src_b);
    
    // ���� irq_config �����������жϻص���
    inst->irq_config.hall_a_port = config->hall_a_port;
    inst->irq_config.hall_a_pin = config->hall_a_pin;
    inst->irq_config.hall_b_port = config->hall_b_port;
    inst->irq_config.hall_b_pin = config->hall_b_pin;
    inst->irq_config.irq_priority = config->irq_priority;
    
    inst->id = g_next_handle_id++;
    inst->valid = 1;
    inst->current_direction = MOTOR_DIRECTION_NONE;
    inst->hall_status = HALL_STATUS_NONE;
    
    inst->active_hall_count = calculate_active_hall_count(inst);
    
    uint8_t j;
    for (j = 0; j < RPM_WINDOW_SIZE; j++) {
        inst->rpm_window[j] = 0;
    }
    inst->write_index = 0;
    inst->valid_count = 0;
    
    for (j = 0; j < 6; j++) {
        inst->interval_history[j] = 0;
    }
    inst->interval_idx = 0;
    inst->interval_valid_count = 0;
    
    nbDelay_Init(&inst->rpm_timer, 10);
    nbDelay_Start(&inst->rpm_timer);
    
    nbDelay_Init(&inst->hall_check_timer, HALL_CHECK_INTERVAL_MS);
    nbDelay_Start(&inst->hall_check_timer);
    
    if (config->eirq_ch_a != 0) {
        register_hall_irq(inst, 1);
    }
    if (config->eirq_ch_b != 0) {
        register_hall_irq(inst, 0);
    }
#if MOTOR_HALL_TRIPLE_ENABLE
    if (config->eirq_ch_c != 0) {
        /* Register Hall C IRQ */
        {
            stc_extint_init_t stcExtiConfig;
            stc_irq_signin_config_t stcIrqRegiConf;
            stc_gpio_init_t stcPortInit;

            memset(&stcExtiConfig, 0, sizeof(stcExtiConfig));
            memset(&stcIrqRegiConf, 0, sizeof(stcIrqRegiConf));
            memset(&stcPortInit, 0, sizeof(stcPortInit));

            stcExtiConfig.u32Filter = EXTINT_FILTER_OFF;
            stcExtiConfig.u32FilterClock = EXTINT_FCLK_DIV1;
            stcExtiConfig.u32Edge = EXTINT_TRIG_BOTH;
            EXTINT_Init(config->eirq_ch_c, &stcExtiConfig);

            GPIO_StructInit(&stcPortInit);
            stcPortInit.u16PinDir = PIN_DIR_IN;
            stcPortInit.u16PinAttr = PIN_ATTR_DIGITAL;
            stcPortInit.u16PullUp = PIN_PU_ON;
            LL_PERIPH_WE(LL_PERIPH_GPIO);
            GPIO_Init(config->hall_c_port, config->hall_c_pin, &stcPortInit);
            GPIO_ExtIntCmd(config->hall_c_port, config->hall_c_pin, ENABLE);
            LL_PERIPH_WP(LL_PERIPH_GPIO);

            stcIrqRegiConf.enIntSrc = (en_int_src_t)config->irq_src_c;
            stcIrqRegiConf.enIRQn = (IRQn_Type)config->irqn_c;
            stcIrqRegiConf.pfnCallback = (func_ptr_t)hall_c_irq_callback;
            INTC_IrqSignIn(&stcIrqRegiConf);

            EXTINT_ClearExtIntStatus(config->eirq_ch_c);
            NVIC_ClearPendingIRQ((IRQn_Type)config->irqn_c);
            NVIC_SetPriority((IRQn_Type)config->irqn_c, config->irq_priority);
            NVIC_EnableIRQ((IRQn_Type)config->irqn_c);

            g_current_hall_c_instance = inst;
        }
    }
#endif

    return (motor_hall_handle_t)inst;
}

void motor_hall_destroy(motor_hall_handle_t handle)
{
    if (!handle) return;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    inst->valid = 0;
}

void motor_hall_start(motor_hall_handle_t handle)
{
    (void)handle;
}

