HCHCHC99/WS/T_v.4.36.15_20260428/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Adp/Motor_hall.c
void motor_hall_stop(motor_hall_handle_t handle)
{
    (void)handle;
}

void motor_hall_update(motor_hall_handle_t handle)
{
    if (!handle) return;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    if (!inst->valid) return;
    
    Timer6_Timebase_UpdateTimestamp();
    
    if (nbDelay_IsComplete(&inst->rpm_timer)) {
        calculate_rpm(inst);
        perform_stall_detection(inst);
        nbDelay_Start(&inst->rpm_timer);
    }
    
    if (nbDelay_IsComplete_noclose(&inst->hall_check_timer)) {
        check_hall_status(inst);
        nbDelay_Start(&inst->hall_check_timer);
    }
}

/* ========== ת����ؽӿ� ========== */

float motor_hall_get_rpm(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    
    if (!inst->is_running) return 0;
    return inst->filtered_rpm;
}

float motor_hall_get_rpm_raw(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    if (!inst->is_running) return 0;
    return inst->current_rpm;
}

uint32_t motor_hall_get_pulse_interval_us(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->last_pulse_interval;
}

uint8_t motor_hall_is_running(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    
    uint64_t current_time_us = Timer6_Timebase_GetTimestamp();
    uint64_t time_since_last_pulse = current_time_us - inst->last_pulse_time_us;
    
    return (time_since_last_pulse <= (STOP_DETECTION_MS * 1000ul));
}

uint8_t motor_hall_is_stalled(motor_hall_handle_t handle)
{
    if (!handle) return 1;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->stalled;
}

/* ========== ������ؽӿ� ========== */

motor_direction_t motor_hall_get_direction(motor_hall_handle_t handle)
{
    if (!handle) return MOTOR_DIRECTION_NONE;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    
    if (inst->current_rpm == 0) return MOTOR_DIRECTION_STOP;
    if (inst->direction_confidence > 50) return inst->current_direction;
    return MOTOR_DIRECTION_NONE;
}

uint8_t motor_hall_get_direction_confidence(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->direction_confidence;
}

uint8_t motor_hall_is_direction_changed(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    uint8_t changed = inst->direction_changed;
    inst->direction_changed = 0;
    return changed;
}

/* ========== ���������ӿ� ========== */

uint32_t motor_hall_get_hall_a_count(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->hall_pulse_counts[0];
}

uint32_t motor_hall_get_hall_b_count(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->hall_pulse_counts[1];
}

#if MOTOR_HALL_TRIPLE_ENABLE
uint32_t motor_hall_get_hall_c_count(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->hall_pulse_counts[2];
}
#endif

uint32_t motor_hall_get_total_pulse_count(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
#if MOTOR_HALL_TRIPLE_ENABLE
    return inst->hall_pulse_counts[0] + inst->hall_pulse_counts[1] + inst->hall_pulse_counts[2];
#else
    return inst->hall_pulse_counts[0] + inst->hall_pulse_counts[1];
#endif
}

void motor_hall_reset_counts(motor_hall_handle_t handle)
{
    if (!handle) return;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    
    __disable_irq();
    inst->hall_pulse_counts[0] = 0;
    inst->hall_pulse_counts[1] = 0;
#if MOTOR_HALL_TRIPLE_ENABLE
    inst->hall_pulse_counts[2] = 0;
#endif
    inst->pulse_counter = 0;
    inst->hall_a_last_second_count = 0;
    inst->hall_b_last_second_count = 0;
    inst->hall_status = HALL_STATUS_NONE;
    __enable_irq();
}

hall_working_status_t motor_hall_get_status(motor_hall_handle_t handle)
{
    if (!handle) return HALL_STATUS_NONE;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->hall_status;
}

uint8_t motor_hall_get_active_hall_count(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->active_hall_count;
}

uint16_t motor_hall_get_pulses_per_rev(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    
    if (inst->config.custom_pulses_per_rev > 0) {
        return inst->config.custom_pulses_per_rev;
    }
    return inst->config.pole_pairs * 2 * inst->active_hall_count;
}

uint8_t motor_hall_get_pole_pairs(motor_hall_handle_t handle)
{
    if (!handle) return 0;
    motor_hall_instance_t* inst = (motor_hall_instance_t*)handle;
    return inst->config.pole_pairs;
}
